ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTachi/pins_arduino.h
/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag).
 * AIN21 (PF5) is not exposed on this board and is intentionally not defined. */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN18  ADC_CH(18)
#define AIN19  ADC_CH(19)
#define AIN20  ADC_CH(20)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

         /*##  ### #   #      ###  ####  ####   ###  #   #  ###
          #   #  #  ##  #     #   # #   # #   # #   #  # #  #
          ####   #  # # #     ##### ####  ####  #####   #    ###
          #      #  #  ##     #   # #  #  #  #  #   #   #       #
          #     ### #   #     #   # #   # #   # #   #   #    # */
#ifdef ARDUINO_MAIN
  // Indexed by digital pin number (0..35). Gaps, USB pins and the unconnected
  // PA0/PA1/PF5 are NOT_A_PORT.
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA5  D0 RX (Serial1)
    PA,         //  1 PA4  D1 TX (Serial1)
    PA,         //  2 PA2  D2 SDA
    PA,         //  3 PA3  D3 SCL/TCB1
    PF,         //  4 PF4  D4
    PD,         //  5 PD0  D5 TCA0 WO0
    PD,         //  6 PD1  D6 TCA0 WO1
    PA,         //  7 PA6  D7 XCK
    PA,         //  8 PA7  D8 XDIR/AC0/EVOUTA
    PD,         //  9 PD2  D9 TCA0 WO2
    PD,         // 10 PD3  D10 TCA0 WO3
    NOT_A_PORT, // 11 (gap)
    NOT_A_PORT, // 12 (gap)
    NOT_A_PORT, // 13 (gap)
    PD,         // 14 PD5  D14 MISO
    PD,         // 15 PD6  D15 SCK/Serial2 TX
    PD,         // 16 PD4  D16 MOSI
    PF,         // 17 PF3  D17 RX LED / LED_BUILTIN
    PD,         // 18 PD7  D18 A0/SS/Serial2 RX
    PF,         // 19 PF0  D19 A1
    PF,         // 20 PF1  D20 A2
    PF,         // 21 PF2  D21 A3/EVOUTF
    NOT_A_PORT, // 22 (gap)
    NOT_A_PORT, // 23 (gap)
    NOT_A_PORT, // 24 (gap)
    NOT_A_PORT, // 25 (gap)
    NOT_A_PORT, // 26 (gap)
    NOT_A_PORT, // 27 (gap)
    NOT_A_PORT, // 28 (gap)
    NOT_A_PORT, // 29 (gap)
    PC,         // 30 PC3  D30 TX LED
    NOT_A_PORT, // 31 PA0  (not connected - reserved)
    NOT_A_PORT, // 32 PA1  (not connected - reserved)
    NOT_A_PORT, // 33 PF5  (not exposed - reserved)
    PF,         // 34 PF6  RESET
    PF          // 35 PF7  UPDI
  };

  /* Bit position within the port (for PINnCTRL access). */
  const uint8_t digital_pin_to_bit_position[] = {
    PIN5_bp,   //  0 PA5
    PIN4_bp,   //  1 PA4
    PIN2_bp,   //  2 PA2
    PIN3_bp,   //  3 PA3
    PIN4_bp,   //  4 PF4
    PIN0_bp,   //  5 PD0
    PIN1_bp,   //  6 PD1
    PIN6_bp,   //  7 PA6
    PIN7_bp,   //  8 PA7
    PIN2_bp,   //  9 PD2
    PIN3_bp,   // 10 PD3
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bp,   // 14 PD5
    PIN6_bp,   // 15 PD6
    PIN4_bp,   // 16 PD4
    PIN3_bp,   // 17 PF3
    PIN7_bp,   // 18 PD7
    PIN0_bp,   // 19 PF0
    PIN1_bp,   // 20 PF1
    PIN2_bp,   // 21 PF2
    NOT_A_PIN, // 22 (gap)
    NOT_A_PIN, // 23 (gap)
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN3_bp,   // 30 PC3
    NOT_A_PIN, // 31 PA0 (not connected)
    NOT_A_PIN, // 32 PA1 (not connected)
    NOT_A_PIN, // 33 PF5 (not exposed)
    PIN6_bp,   // 34 PF6 RESET
    PIN7_bp    // 35 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN5_bm,   //  0 PA5
    PIN4_bm,   //  1 PA4
    PIN2_bm,   //  2 PA2
    PIN3_bm,   //  3 PA3
    PIN4_bm,   //  4 PF4
    PIN0_bm,   //  5 PD0
    PIN1_bm,   //  6 PD1
    PIN6_bm,   //  7 PA6
    PIN7_bm,   //  8 PA7
    PIN2_bm,   //  9 PD2
    PIN3_bm,   // 10 PD3
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bm,   // 14 PD5
    PIN6_bm,   // 15 PD6
    PIN4_bm,   // 16 PD4
    PIN3_bm,   // 17 PF3
    PIN7_bm,   // 18 PD7
    PIN0_bm,   // 19 PF0
    PIN1_bm,   // 20 PF1
    PIN2_bm,   // 21 PF2
    NOT_A_PIN, // 22 (gap)
    NOT_A_PIN, // 23 (gap)
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN3_bm,   // 30 PC3
    NOT_A_PIN, // 31 PA0 (not connected)
    NOT_A_PIN, // 32 PA1 (not connected)
    NOT_A_PIN, // 33 PF5 (not exposed)
    PIN6_bm,   // 34 PF6 RESET
    PIN7_bm    // 35 PF7 UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. Only the TCB outputs are listed (PA2=TCB0, PA3=TCB1). */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA5
    NOT_ON_TIMER, //  1 PA4
    TIMERB0,      //  2 PA2  (TCB0 - used for millis on this board)
    TIMERB1,      //  3 PA3  (TCB1 - D3 PWM)
    NOT_ON_TIMER, //  4 PF4
    NOT_ON_TIMER, //  5 PD0  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PD1  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  7 PA6
    NOT_ON_TIMER, //  8 PA7
    NOT_ON_TIMER, //  9 PD2  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, // 10 PD3  (TCA0 WO3, dynamic)
    NOT_ON_TIMER, // 11 (gap)
    NOT_ON_TIMER, // 12 (gap)
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 PD5  (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 15 PD6
    NOT_ON_TIMER, // 16 PD4  (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 17 PF3
    NOT_ON_TIMER, // 18 PD7
    NOT_ON_TIMER, // 19 PF0
    NOT_ON_TIMER, // 20 PF1
    NOT_ON_TIMER, // 21 PF2
    NOT_ON_TIMER, // 22 (gap)
    NOT_ON_TIMER, // 23 (gap)
    NOT_ON_TIMER, // 24 (gap)
    NOT_ON_TIMER, // 25 (gap)
    NOT_ON_TIMER, // 26 (gap)
    NOT_ON_TIMER, // 27 (gap)
    NOT_ON_TIMER, // 28 (gap)
    NOT_ON_TIMER, // 29 (gap)
    NOT_ON_TIMER, // 30 PC3
    NOT_ON_TIMER, // 31 PA0 (not connected)
    NOT_ON_TIMER, // 32 PA1 (not connected)
    NOT_ON_TIMER, // 33 PF5 (not exposed)
    NOT_ON_TIMER, // 34 PF6 RESET
    NOT_ON_TIMER  // 35 PF7 UPDI
  };
#endif

